标题：自问自答：如何区分自己身处真实世界还是网络世界还是高堡奇人的小说世界中？
作者：LostAbaddon
更新：2016.07.01 02:01:12

问题的来源，是未来局局长小姬开通了分答，让大家问一些足够科幻的问题，于是从不用分答的我就贡献了我的第一次，问的就是这个问题。

这里我就不断小姬的财路了，不写她的答案了。

就我自己来说，这个问题的答案，怕是没那么简单（其实主要是我想码字，所以找了个由头，嗯嗯）。

> 这里吐槽下：一分钟的时间限制，想要回答什么高质量的问题显然是捉襟见肘的，所以分答就算不谈运营，其产品形态也是只能玩娱乐向的——当然我不是说娱乐向有什么不好，相反我一直认为娱乐尤其是游戏化是非常好的。

---

要回答这个问题，我们先要为这三个做一个区分，即找出**真实世界**、**赛博世界**和**幻想世界**这三者的本质属性，从而才能找到根本差异，这样才能做出分辨判断。

下面，我们就用比较简洁的形式来回答这个问题。

> 看这个形式，是不是让人想起了维特根斯坦的《逻辑哲学论》？

> 另，我打个赌，能看完到最后的，必然是马中吕布人中祥瑞……

----

1 **“真实世界”本身或许并不存在**

1.1 任何智能生命必须通过感官来感知世界，而一切感官信息都是值得怀疑的。
1.1.1 大脑的思考过程也是一种感官，所以也值得怀疑。
1.1.2 笛卡尔的“我思故我在”并不能作为思考无法被怀疑的论据，这点丹尼尔·丹尼特通过笛卡尔剧场的思想实验反驳过（可看这篇文章：[《从CK定理，到哲学僵尸》](http://www.jianshu.com/p/5f7267fa3938)，其中的4.1部分），我也通过类似的思辨来反驳过。
1.1.3 缸中之脑。
1.1.4 实验等手段可以看做是人的感官的延伸或者衍生。
1.2 脱离感官及其感受到的现象而谈真实，要么是形而上，要么是扯淡，或者两者都是。
1.3 由上可知：“真实世界”是一种超验的约定：**我们约定存在一个脱离我们的感官感受而存在的世界**。
1.3.1 既然是约定，那么就是可以改变的。
1.3.2 既然是约定，那么就遵守大多数意见领袖的意志。
1.3.3 既然是约定，那么就具有研究共同体在研究历史上的惯性。
1.4 我们对“真实世界”的约定，基本建立在**“具有不以人的意志而转移的恒定的自然规律”**这点上。
1.4.1 量子理论的众多诠释中的一种认为意识会影响量子态的塌缩。
1.4.1.1 这一流派并不是哥本哈根诠释，而是魏格纳与冯·诺依曼为代表的意识诠释。
1.4.1.2 现代物理基本早就不理意识会导致塌缩的想法，但对于量子态的生命尤其是有意识的生命所可能处于的状态依然保持高度好奇和关注。
1.4.1.3 吐槽：**大家不要听大众媒体的以讹传讹**。
1.4.2 规律并不表示知道了过去与现在就能精确预测未来，规律可以是对于未来可能状态的分布的预测。
1.4.2.1 量子现象中系统的末态是几率性的。
1.4.2.2 经典物理的热力学与统计力学中对于系统的演化的描述也是几率性的。
1.5 总结：人几乎没有办法来判断“真实世界”是否“真实”，而只能约定什么是“真实”。

2 **“虚拟世界”可以有多虚拟？**

2.1 一般虚拟世界都是指由计算机虚拟而来的世界。
2.1.1 非计算机虚拟的世界，比如魔法构造的世界，或者漫威最新“全新全异”宇宙中宇宙魔方构造出的世界，或者别的什么乱七八糟的东西，这里一概不讨论。
2.2 一般上面所说的“计算机”代表的是满足图灵机结构（或者$\lambda$演算）的装置。
2.2.1 所以一般而言的虚拟世界必然具有图灵机计算模型的限制。
2.3 计算机虚拟的世界本身可以根据计算机及其上算法的功能而分出许多类别。
2.3.1 有些虚拟世界可以BUG满身，而有些高级虚拟世界可以做到几乎没有BUG。
2.3.2 一条几乎是必然的定理：**越是复杂的系统，出现BUG的几率越高；而复杂到一定程度后，则BUG几乎必然出现。**
2.3.2.1 从复杂系统的角度来看，一个系统越复杂，代表系统的子节点越多，子节点之间的关联性越频繁越强，从而系统内部节点之间的链接数随着系统子节点数的增加而指数级增加。
2.4 计算机的局限来源于其硬件，其上运行的软件，以及背后的数学理论本身。
2.4.1 超过一定精度的计算无法完成
2.4.1.1 只要采用有限位来保存数值，那么就总存在无限的数值是被丢掉精度的。
2.4.1.2 运算需要时间，从而具有最小时间间隔，这个时间间隔下的数据无法被处理。
2.4.1.3 `可能的相关现象：时间与空间的量子化，比如圈量子`
2.4.2 硬件存在计算极限，无论是CPU还是内存
2.4.2.1 同步计算量越大，计算过程中的延迟效应就越明显
2.4.2.1.1 `可能的相关现象：引力红移`
2.4.3 会采用各种优化手段
2.4.3.1 懒汉近似策略：将关注区域外的内容无视，在加载之前都不做初始化。
2.4.3.1.1 `可能的相关现象：费米悖论`
2.4.3.2 并不使用所有可见区域，恰恰相反只使用很少的可见区域，从而降低所需的运算。
2.4.3.2.1 `可能的相关现象：宇宙中大量的空穴`
2.4.3.2.2 迟卉的《伪人》。
2.4.3.3 垃圾回收机制，避免不必要的开销。
2.4.3.3.1 `可能的相关现象：四大力中唯一只有吸引效应的引力以及黑洞`
2.4.4 算法本身可能存在的BUG
2.4.4.1 BUG可能导致系统的崩溃
2.4.4.1.1 `可能的相关现象：黑洞，量子理论与相对论都失去作用的地方`
2.4.4.2 BUG是预期的未达成
2.4.4.2.1 数学物理学家认为物理规律原本应该符合的对称性，在实际世界中都是破缺了的。
2.4.4.2.1.1 当然，物理学家也给出了对称性破缺的机制，而且看上去挺合理。
2.4.4.3 BUG最尴尬的是——它和具有特色的设计有时难以区分
2.4.4.3.1 比如Unix与Linux系统中的隐藏文件源于早起的一条BUG，但现在成了这一系系统的特色。
2.4.4.3.2 `可能的相关现象：人类本身，是BUG，还是自然的结果？`
2.4.5 图灵机结构本身所具有的限制，是根本性的
2.4.5.1 那些已经被证明不可解或者不可证的问题：
2.4.5.1.1 停机问题
2.4.5.1.2 蔡亭常数
2.4.5.1.3 计算生成任意字符串的最短字符串的长度的图灵机
2.4.5.2 假如我们所处的物理世界是计算机模拟的，那么也应该有这一限制
2.4.5.2.1 几个月前有报道一凝聚态理论中的计算结果无法实现的原因，是这一计算涉及到一数学上的不可计算过程。
2.4.5.2.2 假如宇宙本身是模拟的，那么停机可以看做是宇宙完成演化并输出唯一结果，那么宇宙应该是闭合的；而如果宇宙不可停机，那么就是开放的。而现代观测则告诉我们：宇宙目前极有可能是闭合的，但不一定一定具有有限寿命，所以属于“目前无法判定”的状态。
2.4.5.2.3 上面一条试图告诉你“宇宙如果作为图灵机的话似乎看上去是不可判定是否会停机的”，但本质上却和停机问题不是一回事，因为停机问题要求的是通用停机判定机，而不是对某一特定图灵机的判定。
2.4.5.2.4 我们可以考虑所有可能的宇宙构成的集合，那么我们是否可能在知道其中任意一个宇宙的初始条件的情况下，断定其最终到底是闭合的还是开放的呢？这点几乎不可能对所有图灵机都做到。所以上一条的否定也许并不能彻底说明宇宙本身不具有和图灵机一样的停机不可判定性。
2.5 总结：计算机模拟的宇宙会受到硬件与软件的约束，从而出现各种缺陷与瑕疵；同事计算机模拟的宇宙也会受到来自计算理论的约束，从而具有许多不可能做到的行为或者不可能拥有的性质。

3 **小说中的世界**

3.1 小说的世界在规则性上往往具有极强的任意性，从而不够恒定。
3.2 小说的世界一般都具有一条主线。
3.2.1 一个人有可能是小说的核心角色，也有可能是路人甲。
3.2.2 路人甲的命运在高明的作者笔下，依然可以很丰富，但在水货作者笔下基本就是毫无意义的布景。
3.2.2.1 大多数人的一生基本都是作为统计数字而存在的一生，意义捉襟见肘。
3.2.3 核心角色和路人角色都有可能被一个整体性的故事的意志所摆布，从而陷入某些整体性的大事件中。
3.2.4 从概率上说，绝大多数人基本都是路人角色，只有少数是核心角色，所以你觉得你是路人还是主角？

4 **如何区分真实世界、虚拟世界和小说世界？**

4.1 真实世界和虚拟世界的区分，在于寻找那些可能的由于计算的硬件或者软件或者计算理论本身所带来的瑕疵或者不完美，体现在各种限制、不可为以及以意外的方式偏离预期上。
4.1.1 但如何区分一个上述现象到底是要寻找的BUG还是自然规律本身的设计？这个问题只能交给形而上。
4.1.2 我们可以主动地进行一些超出可能的计算系统极限的行为，来测试极限是否存在。
4.2 真实世界与小说世界的区分，在于是否能找到一个全局性的大趋势，且这种趋势具有明显的人格化或者戏剧化的倾向。
4.2.1 但真实世界往往也会随处发生一些具有戏剧性的故事。
4.2.2 可以主动进行一些超出大趋势的安排的行为，来试探或者引起可能存在的世界的作者的意图与注意。
4.3 阻碍分辨上述这些世界的两大障碍：
4.3.1 对世界的认知、理解与分析都建立在感官的基础上，而感官的一切信息本就是值得怀疑的，所以这种认知与判定必然是经验性（基于以往经验）与/或超验性的（基于形而上原理）。
4.3.2 BUG与剑走偏锋的特色设计，以及与自然界的意外结果，往往不可区分。


5 **总结**：我们并不可能找到一个确实可行的方案来区分所有这三个世界，但至少在约束条件下，我们可以尝试性地做出一些刺探。
5.1 但，就如意义本身不是被赋予的也不是被发现的而是被创造的，我们到底生活在哪个世界其实并不重要，自己将自己的世界活成什么样的世界，这个才重要。
5.1.1 自我吐槽：这个结尾好鸡汤……