标题：如果流浪地球的世界里有APTX4869
关键词：物理 脑洞
更新：2023/02/08 21:22:45

在《流浪地球2》的电影中，人们安装在月球上的三台推进器里的两台被MOSS控制并超功率运转，导致了月球的转向，最终落向地球。

>	为什么不三台都超功率运转？因为这样月球受力均匀，就不会转向了，从而只会更快地离开地球而不会砸向地球。只有三台不都坏，才能受力不均匀，从而引起转向。

而作为应对，人类开始在月面安装相控阵核弹，试图利用相控阵来聚焦核爆能量，从而点燃月球核心的重核反应，进而将月球推开。

>	作为比较，1998年美国好莱坞的电影《世界末日（Armageddon）》里，一颗巨大的彗星要撞击地球，美国人采取的方案就是直接正面刚，派钻井小队乘着好几艘航天飞机带着钻井设备与核弹头登陆彗星，顺带不忘习惯性嘲讽一下俄罗斯人，然后在彗星上钻洞，安核弹，最后主演布鲁斯·威利斯为了成全蝙蝠侠与精灵公主的好事而留下来引爆核弹头，牺牲自己的同时把彗星炸成了两半，而且这两半都从地球两边擦肩而过，保住了地球。其中二程度与荒谬程度，放到现在来看也是绝顶的。相比来说，我国科学顾问团就果断放弃了和月球正面刚的编剧设想，这点非常值得肯定与尊敬：__不能为了票房而枉顾科学啊__！

这个方案不可为不壮观，最后沙溢饰演的张鹏等50岁以上的各国航天员为了人类的未来而英勇牺牲，比上一步中刘培强为了人类未来而自我牺牲更让人动容。

但，感动归感动，我们不由要想：真的只能这么牺牲么？

----

首先，我们要明确，炸碎月球是不靠谱的。

这主要有两方面的原因：首先，炸不碎；其次，炸碎了地球更惨。

之所以炸不碎，是因为炸碎一颗天体的意思，就是赋予其足以克服自身引力结合能的能量，而且要均匀分布在整体上。而月球的引力结合能，作为一道高中物理题（上海等地可能已经间隔为初中物理题了），很容易估算出来，__大约是 1.2 × 10^29^ 焦耳__，换算成TNT当量的话，就是__差不多2.87亿亿吨TNT当量__。

而人类目前为止威力最大的核武器是苏联制造的、被誉为“**沙皇炸弹**”的氢弹，其威力差不多是5000万吨TNT当量（*一说5800万吨TNT当年，我们就按照5000来算吧，方便点*），因此，__要把月球炸碎，需要**5736亿**枚沙皇炸弹__，这事就不用指望了。

>	即便是当年的苏联，总共也就制造了两枚沙皇炸弹。

在电影中，人类总共拥有3000枚核弹头，其总威力多少不得而知。一般现代核武器的威力大约都只有沙皇炸弹的百分之一到两百分之一，因为走的是小而精的路线，大当量是在没有必要。那么，找这个估算的话，3000枚也不过是15到30枚沙皇炸弹的威力。而按照ChatGPT给我的回复，人类目前总共拥有的核武器的总威力大约是20亿吨TNT当量，差不多是40枚沙皇炸弹。无论是15、30还是40，距离炸碎月球，还差了10个数量级，完全可以忽略不计。

冷战时期，美苏核弹头总量达到差不多3万枚，总威力大约是300亿吨TNT当量，这是人类拥有的核力量的巅峰，但距离炸碎月球依然差了9个数量级，依然可以忽略不计。

当然，电影和小说里其实还有更加强大的工具可以用来炸碎月球，那就是行星发动机。

按照电影中的设定，一台行星发动机可以提供150亿吨的推力，也就是差不多 1.5 × 10^14^ 牛。当然，要从力推算到功率并不是很直接，我们需要知道喷射工质的速度，但这个数据是未知的。不过我们可以假设地球刹车用的发动机和流浪用的发动机的功率等参数都是相同的，而当我们把地球考虑成一个近似均匀球体时，它的转动能为 9.72 × 10^37^ 焦，刹车经历了42年（小说里是120年，这里以电影为准），用了赤道上的7659台行星发动机（小说里的数据，电影里没提），由此可以计算出每台行星发动机的功率是 9.6 × 10^24^ 瓦，也就是每秒释放 9.6 × 10^24^ 焦的能量，也就是2294万亿吨TNT当量，相当于每秒引爆4589万枚沙皇炸弹。

>	当然，改变转速的同时，因为地球及其上的物质都不是严格刚体，所以显然地球的转动惯量和转动能也都会随之而变，所以这里只不过是估算，不是精确值哦。

这么想来，要炸碎月球其实也就可行了：地球上全部12000座行星发动机每秒释放的总能量可以达到 1.15 × 10^29^ 焦，所以如果所有上帝喷灯怼着月亮一起喷的话，是可以把月球吹散的……

>	同时也可以看出，行星发动机喷射出的推进工质的速度是非常非常接近光速的。

但，就算能炸碎月球（按照电影中的设定，此时地球上还没有把所有计划中的12000座行星发动机都建成，所以上述喷月亮的方案其实还无法实施），但这么做其实对地球来说并不能解决问题，因为炸成碎片后的月球，其总动量基本不变，那么碎片整体还是朝着地球来的。甚至于，有了爆炸的能量加成，袭向地球的月球碎片可能威力更大，能造成更严重的危害。

>	即便12000座上帝喷灯真的喷碎了月球，上述威胁依然存在。月球质量大约是 7.3477 × 10^22^ 千克，每台行星发动机推力为 1.5 × 10^14^ 牛，就算12000台都能分毫不差地都用来让月球减速，那么所有月球碎片的质心每秒被减速不过十万分之2.4米每秒，就算因此而转向，转向幅度也可以忽略不计，所以碎片该砸地球的还是会砸地球。

因此，比较合理的方式，是尽力推开月球，或者学《世界末日》那样，把月球敲成两半，让它们各自离开地球。

电影中的方案，是利用相控阵聚焦核爆能来点燃月球核心，让月球核心发生重核聚变，释放庞大的能量，从而从内部撕裂月球。

当然，如果仅仅是撕裂月球，那其实没用——前面说过了，月球碎片依然会砸向地球，区别不过是本来是一个砂锅大的拳头，现在是成百上千个猩红毒针，哪个更可怕完全取决于个人喜好。

>	有人说核爆不会撕裂月球，而是让它“坍缩成一个小球”，这就纯属扯淡了。能这么干的唯一可能，是让月球中心出现一个小黑洞。这事你别说在月球上搞不了，在太阳里都搞不了，因为质量实在是太小了。而要通过外加压力来压成一个黑洞，那需要的能量都足够解决氦闪危机好几遍了，整这出干嘛……

所以，点燃月核的目的显然要么是把月球撕成几半并让这几半都擦地球而过，要么就是让爆炸能量从相控阵炸出的缺口里喷出从而提供给月球一个足够的切向推力，让月球擦地球而过。

无论如何，关键就是用人类的核弹头点燃月球内部的重核聚变，让月球像一顶超级巨大的行星发动机那样去工作。

这事可能么？

在电影与小说的世界中，人类已经实现了行星发动机，所以至少表示点燃月球不是绝对没可能。

但，在人类的受控环境下实现重核聚变与让月球在自然条件下发生重核聚变是完全不同的两件事，这里的核心在于：首先，要为一开始的重核聚变创造条件；其次，重核聚变开始后，月球内部要能持续维持在一个能保持重核聚变进行下去的环境中。

这里的关键问题就是：即便我们能做到第一点，第二点也是做不到的，因为此时已经不是人力可以控制的了。

先看第一点。

相控阵的基本原理，就是__让各不同位置上的物理过程根据一定的时间顺序依次或者同时发生，以达到将各点物理过程中的相关相位能在目标区域完全叠加在一起而非彼此相消的状态，从而实现能量的聚集__。

比如说，我们在水塘里有两个波源，如果这两个波源的频率与相位符合要求，那么中间位置（或者任意指定位置）的水波振幅就可以保持在叠加状态，从而实现振动幅度最大化。

复杂一点的，比如手机上已经在用的相控阵天线，军事上的相控阵雷达，等等。它们都是为了让电磁波可以聚焦而设计的。

相控阵核爆也是如此，只不过要聚焦的是核爆产生的冲击波与辐射波。

但有一个问题啊，就是它__只能聚焦能量，不能放大能量__。

所以，如果3000枚核弹头的总能量不足以引爆月核的话，那即便是相控阵聚焦，月核依然不可能被点燃。

当然了，即便是最完美的相控阵，也不能让能量一丝不漏的都聚焦在目标区域，损失总是会有的。而这里影响能量聚焦程度的关键，其实就在于各相点的启动时间必须严格控制好。按照电影科学顾问团中设计这一方案的中科院理论物理所的梁文杰教授的提案，大约要控制在至多至多0.01秒误差范围内，这还是在假定月球内部足够均匀的前提下。而这个时间范围，比人类目前的最快神经反应用时0.1秒（这还是训练过的，普通人到不了）小了一个数量级，所以用人来引爆相控阵核弹阵列，引爆是能引爆，但相控阵的作用恐怕是没法实现的。

>	这里其实有一个小小小问题：何必要人来引爆呢？电影中的设定是远程操控因为核弹密码没有破解而无法实现，这里我们不说量子计算机破解经典密码体系的用时问题（根据2022年12月我国科学家提交的一篇论文，375个量子比特的无容错量子计算机可以在8小时内破解RSA-2048密码体系，虽然对这一结论目前业界还存在争议，但到电影中的2058年，相信对于拥有8192个量子体积的550C来说应该不是问题了），以及为何各国提交核弹头的同时居然不提交核弹控制密码这种无法理解的问题，就说在这个设定下，是否真的需要人去按按钮呢？你看，都有门框机器人和笨笨了，调集甚至量产一批机器人去远程控制核弹开关不就好了嘛……

好吧，就算相控阵聚焦核爆得以实现，这里还有一个问题啊，那就是月球核心根据2010年的分析，是一个半径大约240公里的纯铁核，其中会有少量的硫与镍，外层在内月幔的作用下呈熔融态。

铁这个东西对于核聚变与核裂变来说都是一个很头疼的东西，因为它的单位核结合能（这次不是引力结合能，是核力结合能）是所有元素中最高的，也就是说，比它轻的元素如果聚变形成它，可以释放能量；比它重的元素如果裂变形成它，也可以释放能量；但它直接参与的聚变与裂变，都要吸收能量。

它在核反应中就是一枚刹车片，而月球核心都是这种刹车片，几乎没有可以进行核反应的燃料。

地球上的行星发动机就不是这样，它的主要工作是“烧石头”，而石头的主要成分是硅，在大约10亿到30亿度的高温下是可以进行核聚变从而释放能量的（从效率来说，当然是低于氢与氦的聚变的，但地球上氦3少，重氢也少，可石头多啊），所以地球上的行星发动机可以正常工作并推着地球去流浪。

>	顺便一提，硅在重核聚变下会不断聚变，最终形成铁。那，这么多铁疙瘩要怎么处理呢？一个比较可能的方案，是作为行星发动机的推进工质喷出地球。如果真是这样的话，那地球所到之处都会留下一片高速铁屑云，不知道会为后世误入此间的星际探险家们留下多么恐怖与血腥的传说啊……

>	另外还有一点需要大家注意，行星发动机所需的10亿到30亿度的温度，是连太阳核心都远远达不到的超高温。而且，如果太阳核心能达到这个温度的话，那么氢聚变形成的氦就会进一步聚变形成更重的元素比如铍或碳，而不会以简并态积累在太阳内部。而没有了简并态堆积在核心的氦球，自然也就不会发生氦闪。所以如果人类真的能实现行星发动机，那么根本不需要害怕氦闪，直接把一台行星发动机丢进太阳核心（行星发动机的温度比太阳高得多，所以不怕），就能让太阳进一步发生原本无法发生的核聚变从而避免氦闪了。

可月核不行，它几乎没有任何东西可以来进行核聚变，那一大坨铁鼻涕在遭受相控阵核爆的瘙痒后，只会扭动几下，然后继续保持呆呆傻傻。

这就尴尬了：没法核聚变，那怎么产生巨大的能量来推跑月球呢？

有朋友会天真的认为可以点燃月球上储量丰富的氦3资源，来炸碎或者推开月球。毕竟，月球上的氦3储量估计是100万吨，而氦3的聚变过程是2个氦3聚变成一个氦4加两个质子，同时释放12.86 MeV的能量，所以100万吨氦3大约可以产生49.16万亿吨TNT当量的能量，炸碎月球差点意思，但推跑应该问题不大。

>	这也是氦3是清洁能源的原因：质子和氦都很容易控制，不像中子那么横冲直撞无法控制所以是危险的辐射。

>	另，水星上的氦3储量估算大约是月球上的9倍，只可惜那里环境比月球差了不止一点点，估计开采是无望了。

但这个想法是不靠谱的，因为氦3在月球上的分布可以认为是均匀分摊在月球表面的，开采收集就需要花费大量的时间，此后还要对月壤进行提纯精炼，时间完全不够。

那么，除了修改物理法则让铁能聚变之外，难道就没有别的方法了么？

现在，就让我们回到本文标题的后半段来：__APTX4869__。

这货出产自青山刚昌的《名侦探柯南》，是一块富含黑科技的逆天神药——按照目前主线剧情推测，这货大概是乌丸莲耶家族用来返老还童长生不死的，柯南的干妈应该就服用过，但这些目前都只是大家的猜测，没有来自73老妖的实锤。

但这个药物有一个非常不科学的设定，可以说是目前在比较正常的世界设定下最不科学排名中能列进前三的，能走在它前面的大概也就是《宇宙英雄奥特曼》系列了……

>	什么叫比较正常的世界设定？《天元突破》那种踩着星系打架、拿星系当飞盘丢的机器人就叫不正常的世界设定。

为什么说这部以科（kuang）学（sa）探（gou）案（liang）为埋点的推理作品很不科学？不是因为那时不时雷人一下的柯学设定，而是APTX4869这款药。

按照设定，这要能让一个成年人的身体缩小，变得年轻，从一个大人变成小孩。

看上去很正常对不对？

可问题是：一个成年人变成小孩以后，质量去哪了？

都变成汗水了么？显然不可能啊，动画和漫画里都没有流出一浴缸汗这样的设定啊。

所以，服用APTX4869的工藤新一在科学家眼里就仿佛beta衰变中原子核一样，存在一个巨大的问题：__质量去哪了__？

原子核的beta衰变中，消失的质量其实是被中微子带走的，那么工藤新一变成江户川柯南的过程中，消失的质量难道也是被中微子带走的么？

当然，也可能是引力波。

可无论如何，新一同学都必须释放能量——所以他在变小的时候会痛苦的嚎叫与发热，这个设定就很合理。

他要释放多少能量？

按照日本高中男生的平均体重来看，新一同学大约重63公斤。而按照日本小学男生的平均体重来看，柯南同学大约重34公斤。所以，服用APTX4869后，他会释放29公斤的能量（汗水就忽略不计了，喷10公斤汗水出来的场面太鬼畜了，就交给B站的同学了）。

根据爱因斯坦的质能公式，29公斤的消失质量，无论是以中微子还是以引力波的形式，都将释放出260亿亿焦耳的能量，也就是差不多6.23亿吨TNT当量，等于同时引爆12.46枚沙皇炸弹，和《流浪地球2》电影中人类引爆的全部3000枚核弹头所释放的能量已经差不多了。

惊讶了不？

工藤新一每次服用APTX4869变身成柯南，都等于在东京街头一次性引爆人类所有的核弹头，这事想想就太刺激了，而且关键是这哥们还干了不止一次啊！

>	有朋友可能会问：那柯南要怎么变回新一？能量从哪里来？
关于这个问题，我只能说：鬼知道啊！

>	另，知道为什么奥特曼能排在柯南牵头么？因为奥特曼按照设定，是可以缩小并附身在其人间体身上的，而奥特曼的体重在25000到50000吨，这个头缩小一次要释放的能量差不多等于2148万枚沙皇炸弹同时自爆……用来打怪兽属实浪费了……

因此，如果，让工藤新一、宫野志保以及赤井玛丽这三位APTX4869后只缩小而不死的猛人，一起来到月球，同时服下APTX4869这款神药，那就差不多等于一下子引爆了10000枚核弹头，这威力，何其壮哉！

当然，光这样还是不够的。

柯南世界里红厂和黑厂，拢共几百号人，统统送到月球，站成一个相控阵，然后集体按照恰当的顺序服用APTX4869，由此形成的爆炸，别说点燃月球了，炸穿月球都不是没有可能（当然，离炸碎月球还差了那么亿点意思）。

更进一步，找1亿人来到月球集体服用APTX4869，产生的能量就足够炸碎月球了。当然，光炸碎其实没用，所以我们应该是让这1亿位勇士，以特定的队形站好，以确保爆炸形成的冲击波能聚集起来推开月球。

这事相信阿笠博士是可以做到的。

所以，如果流浪宇宙的世界里有APTX4869的话，那其实根本不用担心月球危机已经此后的木星危机。

这事想想……真TMD扯淡啊……

{|}*\*　\*　\**

好了，如果大家对本期内容还满意的话，欢迎一起想想下期内容再开什么脑洞哦！