标题：太空旅行对人类的生理与心理的影响
关键词：科普 太空
更新：2021/12/08 23:42:45

[toc]

#	环境特点

-	振动、冲击、噪声、失重、超重、宇宙辐射、高真空、昼夜节律变化、剧烈的温度变化、超负荷的心理和工作压力等
-	相关纪录
	+	在太空中累计呆得最久的人，是俄罗斯宇航员根纳季·帕达尔卡，他在1998到2015年间共进入太空5次，完成了10次舱外活动，共在太空站里呆了878天11小时又29分钟。
	+	在太空中单次停留时间最长的则是俄罗斯宇航员瓦列里·波利亚科夫，他在1994年1月的一次航天任务中停留在和平号空间站上长达437天17小时又58分钟。
	+	因意外而滞留太空时间最长的是宇航员是苏联的谢尔盖·克里卡廖夫，他进入和平号空间站后恰逢苏联解体，被遗忘在空间站中长达311天20小时后才被俄罗斯宇航局接回地球。

#	心理影响

-	[太空心理学](https://baike.baidu.com/item/%E5%A4%AA%E7%A9%BA%E5%BF%83%E7%90%86%E5%AD%A6/7412020 "太空心理学")
	+	太空中狭小的生活环境、噪音与振动、低重力与人造重力、温度与湿度这些都和地球上不同，会对人的心理产生不利影响。
			*	太空噪声，主要有两个来源：一个是航天器动力系统的噪声，主要是宽频部分的，低频部分声压较高；另一部分来自航天器通过稠密大气时边缘气涡造成的噪声，高频部分为主，但在进入太空中后会消失。这些噪声有时高达125分贝，属于强噪音范畴。
			*	太空综合症，又称为宇宙病，主要症状表现为腹部不适、恶心、呕吐、苍白、出汗，又是可能出现倒立或倾斜等体感错觉，回到地球后需要一周左右才能适应恢复，但依然可能复发。通过训练可以提升对此病的耐受性。
			*	太空中的特殊光线环境会对宇航员的睡眠带来影响，进而影响其心理状态。地球上人们的睡眠与清醒周期会受疲倦程度和环境亮度特别是日光这两方面的影响，但在太空中宇航员无法利用日光调节睡眠规律，从而出现睡眠紊乱，十分痛苦。
	+	心理上的孤独情绪，从而引起强烈的思乡情绪，被称为“情感剥夺”。
			*	苏联航天员萨佳德（曾在和平号上工作过半年）经常会在和地面通讯时告诉地面他“很想家，希望早日与妻儿团聚”。他甚至提议未来如果需要宇航员在空间站停留超过半年的话应该允许宇航员携带家属前往。他同时也提议应该让宇航员经常与家人保持联系。
			*	2018年8月29日，NASA和俄罗斯国家航天机构发现国际空间站舱内出现氧气泄漏的迹象。据俄方称，这次泄露系一位名叫埃雷纳·奥翁的美国女宇航员故意制造了这起事件，原因是她当时的心理状态出现了问题，试图通过破坏飞船达到提前返回地球的目的。
	+	由“情感剥夺”引起的另一个心理变化是“孤寂旅程中的同性相恋”。
			*	在早期全部都是男性的太空旅行中，情感剥夺会导致同性恋情高发，也被称为“太空同性恋”。这在同阿姆斯特朗一起等于的柯林斯自己出版的书《升空》中有所提及。
	+	空间站内的文化心理变化
			*	很多俄罗斯宇航员都曾表示自己无法忍受单调乏味的速冻或脱水食物，认为这医学上健康有益的食谱兼职就是犯罪，他们非常渴望吃上一口热狗、汉堡包或冰激凌。在这种折磨下，宇航员体重会骤降。
			*	太空站中的语言环境如果过于单一，会导致小语种持有者发生语言障碍等现象。
			*	“火星500天”项目显示长期的“紧闭环境”会使得人际关系的问题平均增加了，在项目后期增加来0%，心理学家表示长期处于这类情绪抑制状态会导致精神崩溃
					*	在该项目中也出现了极地科考中的“第三季度现象”：随着时间的推移，参与者的善意出现减少，一些参与者退出了与他人的互动
					*	“我们发现，当人们长时间处于禁闭状态时，某些时候似乎对心理功能来说更为重要，特别是当你所受的刺激非常有限的情况下，过了一段时间，你会变得很容易被激怒，任何种类的声音或刺激给你的感受可能都会太过强烈。它会让你感到不舒服。这是我们在火星500计划中观察到的。当然会有个体差异，但有些宇航员大幅度的减少了与人的互动。我把它解释为一种保护自己的方式。”
	+	长期太空任务可能引起的心理问题
			*	引起宇航员的精神类疾病，具体表现为严重焦虑等适应障碍、紧张性头疼等躯体障碍及衰弱症，衰弱症症状包括不明原因的疲惫、焦虑、绝望、精神过敏、精力难以集中、健忘、头痛、失眠、做噩梦、身体疼痛等
					*	在1981年至1989年期间的航天飞机任务后，有34例航天员负面行为征兆和症状的报道；在1995年至1998年的“和平”号空间站任务中更是发生了两起精神病性事件。
			*	总观效应：当宇航员在航行太空时，因为从太空或者月球表面观看地球时经历的认知转变。他们从多数人无法体验的角度观察熟悉的城市时，产生如同世界之大而人类纷争及边界的狭小的感慨或者想法。这种因太空旅行在视觉和认知上，对世界感到敬畏、威严、惊奇等，并对人类产生一体感的认知转换，使宇航员见证到世界的美并不因政治界线而有阻碍，自然产生要保护地球及其生态和所有人类的想法
					*	太空给人类的三次启示
							*	第一次启示：强烈感受到所有人类是一体的，所有人类和整个地球也是一体的，感受到人类既伟大又渺小，同时对人类整体产生一种发自内心的怜悯。
							*	第二次启示：感受到人类文明、科技、文化的伟大，并强烈地感受到要将人类文明延续下去的重任。
							*	第三次启示：强烈地感受到人类在宇宙中肯定不是唯一的，肯定还有其它文明存在。
			*	情感依赖甚至深度上瘾
				临床神经学家在研究网络成瘾现象时发现，当人处于从一个生活状态到另一个生活状态的转变期时，对网络的依赖会增加，因为网络提供的社交渠道以及与过去社交圈的联系、信息流的轰炸，会在很大程度上缓解焦虑与社交困境，所以人们会表现出对网络的重度依赖甚至深度成瘾现象。这在太空环境中也是有可能的出现的，尤其在未来，太空中的网络甚至虚拟现实技术如果成熟，那么对于进入太空进行长期工作的人员就可能造成虚拟现实上瘾症。
				治疗手段包括服用抗抑郁类药物。
	+	回到地球的宇航员的心理特征主要有两种：一种是自此隐退，不再上太空；另一种是沉迷与太空相关的一切，全力投入再次升空甚至火星旅行等情绪中。当然还可能出现一些偏激行为。
			*	登月第一人在返回地球后就处于深居简出的状态，几乎不接受任何采访，只在总统邀请时才出现，作为登月第一人与大众做简短互动。
			*	而登月第二人奥尔特林则长期处于沮丧状态，因为他不想永远只做登月第二人，此后与妻子分手，并酗酒而接受精神治疗。此后投身于对未来太空旅行的畅想，并成为一名科幻小说作家。
			*	美国的女航天员诺瓦克回到地球后曾经不顾后果地追杀情敌事件。
	+	极低科考中的“第三季度现象”（the third quarter phenomenon）
			*	当人们意识到自己已经被长时间困在某种无法逃离的情境中、开始丧失行动积极性的现象
			*	人们的攻击性与情绪爆发会增加
	+	和平号空间上的心理支持方法
			1.	家人和心理保障组通过补给飞船送去私人包裹
			1.	上传母语录音与文字版的家乡新闻（每周一次）
			1.	专门编辑的音视频休闲娱乐节目
			1.	个人喜好物品（书籍、游戏、消遣玩具等等）
			1.	允许使用无线电波与地球进行业余无线电通讯
			1.	来自亲友的Email（每天）
			1.	每周至少15分钟的私人家庭交流时间（音视频会议）
			1.	每周至少15分钟的心理专家私密交流时间（音视频）
			1.	常规与不定期的专业心理支持
	+	心理评估方法
			*	2016年1月到2018年2月，日本筑波空间中心JAXA（日本宇宙航空研究开发机构）的封闭隔离舱实验发现，实验人员在模拟隔离舱环境中会出现唾液应激激素（皮质醇）的昼夜规律紊乱，以及面部表情的扭曲增加（比如左右不对称更加明显）
					*	唾液皮质醇的昼夜节律在隔离舱驻留期开始时和结束的前一天被打乱
					*	面部扭曲测试的结果，包括测量面部表情的左右对称等，显示在隔离舱停留期间扭曲程度增加
			*	这项研究的结果表明，唾液皮质醇水平和面部表情的扭曲可以作为压力生物标志，不仅可以在太空环境中使用，而且可以在更广泛的环境中使用。
-	与南极可靠的相似性
	+	将南极比作太空确实合适。首先，南极很黑暗，每年都有长达几个月的时间处于极夜之中，这会打破我们习惯的昼夜周期；其次，南极苦寒无比，气温可低至零下80摄氏度，导致人们很难外出行动；最后，南极会使人感到与世隔绝，既有物理上的隔绝、又有社会意义上的隔绝，毕竟那里人烟着实稀少。
	+	极地探险家们提出过“第三季度现象”（the third quarter phenomenon）的概念即当人们意识到自己已经被长时间困在某种无法逃离的情境中、开始丧失行动积极性的现象。
			+	1973年，美国空间站“太空实验室”（Skylab）上的宇航员们一度宣布罢工、拒绝与任务指挥中心联系。他们抱怨工作强度过大，要求对日程安排适当放宽。而这一要求被驳回后，他们决定由自己掌握主动权，于是整天除了欣赏舷窗外的美景之外、几乎什么也不干。
			+	南极康宏站周边的平均温度只有零下60度，外界人员只有在11月至2月之间才能来到此地。但这里的工作人员并非在任务期过半时才开始感到抑郁，相反，他们在感到情绪低迷、与世隔绝时，就开始进入所谓的“心理冬眠”状态了。这种冬眠状态可能是件好事，可以帮助工作人员们节省资源。
			+	这些太空任务的策划中们很清楚无聊和单调可能带来的风险，因此必须为宇航员们设计“量身定制”的娱乐活动，借此抵消这些负面情绪。
	+	人们在冬季的南极待得越久，情绪波动就越大。
	+	科学家在南极开展了一项实验，让一名前NASA宇航员佩戴VR（虚拟现实）头盔，观察该做法是否能帮助科考人员解决与世隔绝时的心理需求。而这名宇航员表示，每次戴上头盔后，他的确有种从日常环境中脱身出来的感觉。科考站的工作人员已经开始主动佩戴VR头盔了，说明VR技术在这种情况下的确有用。

##   宇航员的心理要求

-	能忍受无聊
-	性格偏内向，社交要求小
-	能在一定程度上无视自己做错的事情
-	团队内部要和谐

#	对人类身体的影响

-	肌肉运动知觉的丧失
	+	因为不用怎么使用肌肉，所以钙、磷、镁等微量元素不再被需要，会随尿液流失，引起肌肉萎缩、骨质疏松
	+	肌肉量、肌肉力量以及最大氧气摄取速度都会下降10%到20%
	+	肌肉萎缩，并影响平衡能力
	+	红酒中的白藜芦醇有助于防止肌肉萎缩（出自《[2019年世界载人航天发展报告](http://www.cmse.gov.cn/dmt/cbw/zrhtndbg/202108/W020210811346744964786.pdf "2019年世界载人航天发展报告")》）
-	体液分布的改变
	+	下肢10%的体液会流入上身尤其是头部，会引起剧烈头痛，并在头两天会通过各种方式来排出体液。这种现象被称为“头部乌腿”综合症（puffy face–bird leg syndrome），表现为脸部肿胀、腿部缩小。
	+	在体液改变的情况下，味觉也会发生变化，宇航员表示带上太空的上好巧克力吃起来也味同嚼蜡（[摘自《连线》杂志采访有五次太空任务经验的NASA宇航员玛莎·埃文斯的记录](https://dq.yam.com/post.php?id=2956 "摘自《连线》杂志采访有五次太空任务经验的NASA宇航员玛莎·埃文斯的记录")）
	+	体液集中在头部也会增加视神经压力，对眼球形状与视网膜神经都会带来影响
	+	低重力环境下，血液与脊液往上流动，加上太空舱内的二氧化碳浓度较高，这些都会导致颅内压升高，而颅内压升高会导致眼睛出现视盘水肿和棉絮状斑，影响宇航员视力
			+	NASA科学家发现佩戴普通游泳眼镜可以在一定程度上缓解眼内压深高带来的负面影响（出自《[2019年世界载人航天发展报告](http://www.cmse.gov.cn/dmt/cbw/zrhtndbg/202108/W020210811346744964786.pdf "2019年世界载人航天发展报告")》）
	+	脑脊液会发生永久性的体积膨胀，将水分挤入脑白质引起充水性膨大，压缩脑垂体（[出处点这里](https://www.sohu.com/a/484069272_135797 "出处点这里")，最近研究[点这里](https://mp.weixin.qq.com/s/bTRVtj9aN4A5qRRWpErzog "点这里")）
	+	太空中动物的动脉不再调节大脑的压力
		微重力环境下血液涌向头部增加颅内压，而原本通过扩张或缩小动脉血管可以减轻对大脑的压力，但在太空中动物的大脑动脉完全停止了任何膨胀和收缩。
		（出自《[载人航天动态2020年第六期](http://www.cmse.gov.cn/dmt/cbw/zrhtdt/2020nzrhtdt/202108/P020210810500596438616.pdf "载人航天动态2020年第六期")》）
-	肌肉骨骼系统退化
	+	脊柱会被拉长，所以人会“长高”几厘米
	+	骨质疏松会引起肾结石与易骨折
	+	有宇航员在太空呆了6个月后，小腿肌肉流失60%，爆发力减小一半
	+	因此NASA目前要求宇航员一天至少做两小时的运动
-	内脏也会产生相应变化
	+	胃会变得扁平
	+	心脏会因为压力降低而缩小
	+	心房会膨胀，刺激ANP（心房利钠肽）分泌，抑制身体RAA系统（renin-aldosterone-angiotensin，肾素-血管张力素-醛固酮），这两种机制会促进肾脏排除更多水分与盐分（体液转移反射性多尿），在太空的第一个24小时中，这一过程会使得人体血浆容量减少17%，红血球变浓，血比容上升，肾脏会应急反应，减少红血球生成素的分泌，最终导致宇航员贫血、心律不齐、心肌缺氧以及心肌的退行性变化，并出现相应的心脏功能障碍
	+	反过来，逆过程使得回到地面的宇航员出现头晕、心跳加速等现象
-	对大脑的影响
	+	太空飞行也可能会降低大脑的学习能力
		2020年5月25日，俄罗斯科学院生物医学问题研究所（IBMP）副所长弗拉基米尔·瑟乔夫发文称，在生物卫星Bion-M中进行的动物实验表明，太空驻留可能会使人类的学习能力下降三分之一。（出自《[载人航天动态2020年第六期](http://www.cmse.gov.cn/dmt/cbw/zrhtdt/2020nzrhtdt/202108/P020210810500596438616.pdf "载人航天动态2020年第六期")》）
	+	微重力环境会改变大脑的连通性
		根据俄罗斯与比利时组建的国际团队的研究，微重力环境下平衡器官无法提供可靠信息，为了弥补这一变化大脑会自行建立体感控制辅助系统，增加对视觉和触觉反馈的依赖，减少对前厅输入的依赖，大脑皮质和前厅核之间的连通会减弱以降低这些结构的活动量，避免与环境信息的冲突。
		胼胝体的微结构（即神经连接线路）会在脑脊液的压迫下发生改变。
		小脑与其它结构（特别是负责运动的结构，如皮质脑桥束、皮层脊髓束等）的连接也会减少。
		左右半脑的岛叶皮质之间，以及岛叶皮质和大脑其它区域之间的联系则会增加。
		（出自《[2019年世界载人航天发展报告](http://www.cmse.gov.cn/dmt/cbw/zrhtndbg/202108/W020210811346744964786.pdf "2019年世界载人航天发展报告")》）
	+	深空旅行可能会损伤大脑
		根据《eNeuro》杂志上的一篇文章的报道，深空中存在的长达6个月的低剂量辐射会导致小鼠的神经和行为损伤，损害海马体和前额皮质的细胞信号传递，导致学习和记忆力损伤。大脑杏仁核也会被辐射损伤，引起焦虑等行为。
		这些现象在航天员身上也出现了，在一次深空任务中，约五分之一航天员出现了焦虑，三分之一航天员出现了记忆力衰退，少数航天员在做决定时出现了困难。
		（出自《[2019年世界载人航天发展报告](http://www.cmse.gov.cn/dmt/cbw/zrhtndbg/202108/W020210811346744964786.pdf "2019年世界载人航天发展报告")》）
-	皮肤会变薄约20%（德国科学家研究结果）
-	长期出舱工作（比如太空行走）可能引起减压病
-	太空辐射的影响
	+	如果发生太阳闪烟现象，数分钟的辐射量就是致命的
	+	辐射会对干细胞造成短期与长期影响
	+	辐射会造成淋巴细胞的染色体异常，可能会使得宇航员体内被免疫系统抑制的病毒被重新活化
	+	辐射会抑制免疫系统中T细胞的生成
	+	辐射也会增大白内障的发生几率，影响宇航员视力
			+	前苏联太空人Valentin Lebedev于1982年在轨道上待了221天，因而导致白内障造成的视力损失
	+	NASA肯尼迪航空中心专家Ray Wheeler表示，番茄、蓝莓、红莴苣等蔬菜水果是很好的抗氧化剂食源，在太空中多吃这些新鲜果蔬不但对心理情绪有益，而且还有助于防范太空辐射带来的伤害。
-	睡眠剥夺现象
	+	在2011年结束的、为期17个月的“火星500”任务中，六名乘员中有四人都出现了睡眠失调。其中一人患上了慢性睡眠剥夺症，另一人的睡眠时间则与其他团队成员毫不同步。
	+	月球上的昼夜比地球上要慢很多，但另一方面，载人飞船可能需要环绕地球运动，绕地球一周只需要90分钟，那么他们会遇到昼夜过于频繁的问题，也会导致睡眠紊乱
-	刚进入太空的人（以及刚回到地面的人）会出现“晕太空船”病症，原理和晕船、晕机是一样的，由眼睛与内耳平衡器的感受不一致而导致。太空中因为连上下的方向感都丢失了，所以晕太空船会更严重，人的体感会完全混乱。而当适应太空的宇航员回到地面后，相反的过程又会出现，再次体会严重的晕太空船现象，可以称之为“晕地”。发生这种病症的宇航员占总数的三分之一到一半，且已进入太空/返回地面就会发病，一般持续一周
	+	返回地球时，内耳会在引力逐渐增强的过程中变得非常敏感，很多宇航员刚回到地面时，几乎只要转个头就会立刻跌到，因为身体还没有习惯重新回到有引力的环境。
-	大脑中的灰质与白质会减少，且白质减少是不可逆的（俄罗斯对100位在天空中生活一个月以上的俄罗斯宇航员的研究结果）
-	大脑垂体腺缩小
	通过研究在太空站中住了半年的俄罗斯航天员的大脑结构后发现，颅内压升高导致脑垂体变得更加扁平与凹陷（[出处点这里](https://mp.weixin.qq.com/s/bTRVtj9aN4A5qRRWpErzog "出处点这里")）。
-	长期呆在太空，会出现睡眠问题、疲劳、情绪低落、免疫系统变化等情况
-	暴露在太空环境中的短期影响（[Explosive Decompression and Vacuum Exposure](http://www.geoffreylandis.com/vacuum.html "Explosive Decompression and Vacuum Exposure")）
	+	供氧不足的情况下，意识还可以维持 9-11 秒。
	+	紧接着，身体会发生瘫痪和抽搐。
	+	这一时期，软组织和静脉中快速形成水汽，导致身体肿胀为原来的两倍，除非有增压服能够约束住身体。（已证明：适当配备的弹性服装可以在压力低于 15 毫米汞柱的情况下完全阻止体液沸腾。）
	+	心率先上升，然后快速下降。动脉血压在 30-60 秒期间内也快速下降。静脉血压由于气体产生膨胀而上升，一分钟内会超过动脉血压。血液循环将停止。肺部气体因减压而快速排出，之后水汽还会持续从气道流出，这种持续的蒸发会令口鼻温度降温到接近结冰点。身体其余部分也会降温，但比较慢。
-	真空环境的威胁
	+	人暴露在真空环境中最多只能存活1\~2分钟，且只能在最开始10秒内保持意识。两分钟后会脑死亡。
	+	直接暴露在太空中，汗液、唾液和泪液都会迅速蒸发，肺部的空气会撑破肺泡（张开嘴巴的话会好一点），人死后因为血管压力压降，血液会失压然后沸腾。

##	太空旅行中的男女差异

-	升空时女性更容易感到恶心眩晕
-	返回地面时男性更容易产生恶心呕吐感
-	回到地面后，男性更容易出现视觉与听觉上的问题，女性更容易血压过高从而犯晕
-	男性在太空中精子含量会降低，对女性的影响目前为止，对生育的影响也未知，不过建议女性上太空之前先冷冻卵子
	-	有人推测辐射会影响子宫中的胎儿的生长发育，尤其对大脑的形成，如果长期生活在太空中，可能会积累大量发育错误导致严重问题

##	其它影响

-	太空中运动时，汗水不会流下，而是积累并覆盖在皮肤表面，此时如果突然运动，则汗水会成片地飞溅到旁边宇航员的身上甚至脸上，很不礼貌。
-	任何液体在真空环境中都可能是致命的，尤其是头盔中的液体，可能会让宇航员被淹死，比如他/她自己的呕吐物。
-	研究人员指出，假如你在太空中做错了某件事、并且无论怎么做都于事无补，那么把它忘到脑后也许的确是最健康的做法。
-	宇航员睡觉时会将自己的双臂绑好，不然第二天醒来会惊讶于自己眼前飘着的到底是什么，然后才反应过来哦原来是自己的手臂（《连线》采访玛莎埃·文斯中的记录）
-	月球表面的稀薄月尘可能会破坏电子设备与机械设备，甚至在被人吸入后可能会破坏肺部。
	-	月尘非常微小，且在静电作用下会在月球表面形成一种看不见、非常稀薄但危害极大的“PM5毒霾”，所以必须要通过除静电与除尘设备来确保去除危险的月尘。

##	在空间站呆了340天的马克·凯利在回到地面后的情况

-	头四天里，颈动脉等血管一直都比正常的要粗
-	经常被用来预测心血管疾病预兆的C反应蛋白（CRP）在凯利的血液含量中也明显增加，36天后才恢复正常
-	T细胞等62个免疫细胞指数中有52异常，身体免疫系统被完全打乱，回到地面后不久恢复
-	DNA有上千处突变，主要表现为倒置和移位，回到地面9个月后依然没有被自体完全修复
-	染色体末端的端粒增长14.5%，所以凯利可能被延长了14.5%的寿命，算是意外之喜，但也可能导致癌症风险增加。回到地面后，端粒长度恢复正常，甚至有些细胞里还更短了。
-	凯利在太空的前半年里，在恰当训练下，身体与骨骼的再生能力增加了50%到60%，但后半年开始恶化，回到地面后恢复正常。
-	在太空中，认知能力增强，但情绪辨别能力下降

##   太空环境中的生物生存

-	每日航天网2020年5月27日的文章中写道，荷兰拉德堡德大学医学中心挑选了4中具有治病特性的、对环境来源没有挑剔的细菌（包括肺炎克雷伯菌和铜绿假单胞菌），发现它们在含碳陨石中的碳水化合物配上氮、磷、硫、铁后，可以以最低限度的状态存活，并具有更强的免疫原性（即免疫系统对细菌的反应更强烈）。因此太空中的航天员存在更大的患病风险：细菌更具免疫原性的同时，太空环境对航天员的免疫系统还会产生负面影响。
-	1990年，第一只鹌鹑在空间站上破壳而出；1999年，第一次将太空中孕育的鹌鹑被活着带回地面
-	芝麻菜种子在太空放置六个月后仍可发芽
-	2018年12月，首次3D打印生物活体组织实验成功
-	2019年10月，以色列Aleph Farms公司与俄美首次在国际空间站实现了3D打印的人造牛肉（制作方法与地球上的3D打印的人造肉制作方法基本相同）
	-	这次实验中观测到一个特点：微重力环境下3D打印的肌肉组织细胞生长速度比地球上快，且会往各个方向各向同性地生长
	-	但目前打印1KG的人造牛肉，需要10,000\~15,000生的水，因此显然目前无法大规模使用

#	地球上的模拟太空实验

-	天狼星模拟登月实验
	天狼星SIRIUS是“Scientific International Research In Unique Terrestrial Station”（在独特地面站进行的国际科学研究）的意思
	-	利用带有虚拟现实头盔的特制服装进行交互式的模拟登月过程
	-	模拟内容包括
			-	飞向月球轨道
			-	寻找着陆地点
			-	登录月球表面
			-	月表驻留
			-	远程遥控月球车
			-	建立月球基地
			-	返回地球
	-	特制“宇航服”可记录整个模拟实验过程中的工效学、医学与心理学方面的支持效果，并模拟各种异常情况与复杂环境，记录实验人员的身体与心理反应
-	HERA模拟任务：载人探索研究模拟任务，是NASA人体研究计划系列实验中的一个，主要研究飞行条件对航天员的生理和心理影响，尤其是延长隔离和受限对生理和心理的影响。

#	时间与历法

-	月球一天差不多就是地球上的一个月，即29天。
-	月球显然不可能存在自然的历法，它所用的历法将是地球历法的延续，可能的改变是没有置闰规则，当然在前期肯定继续沿用有置闰规则的历法。
-	这样在心理上可能会产生这么一种分歧
	+	采用传统有置闰规则的现代地球历法的人在心理上更认同地球
	+	采用无置闰规则历法的人在心理上更倾向于是独立于地球新太空人

#	相关技术

-	机器人
-	AI
-	元宇宙
-	3D打印
-	温差发电
-	光电
-	可控核聚变（以氦3为主要燃料）